Revit 2024 API
BuiltInFailures.MEPCalculationFailures.PipeConnectorsAreNotLined Property
 A calculation did not complete because the connectors used by this family to connect to the network are not linked.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId PipeConnectorsAreNotLined { get; }
Visual Basic
Public Shared ReadOnly Property PipeConnectorsAreNotLined As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ PipeConnectorsAreNotLined {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace